-- 1. 주석
-- : sql 문법이 아닌 설명을 덧붙이거나, 메모를 작성하고 싶은 경우
-- 단축키: ctrl + /

-- 이것은 sql 문법이 아닙니다.

-- 1-1. 주석 표현 방법
-- 한 줄 주석
-- 하이픈(-) 2개  사용 후 띄어쓰기 한 칸
# 샾(#) 1개 사용 후 띄어쓰기 한 칸

-- 1-2. 여러 줄 주석
/**
슬래시 사이에 별기호 2개 사용
해당 주석 사이의 문장은 모두
sql 리더기에서 읽히지 않음.

여러 문장을 작성해도 
여러 줄 모두 주석으로 인식
**/

-- 2. 글자 크기 변경
-- : ctrl 누르고 마우스 스크롤 위/아래
-- Edit > Preferences

-- 3. sql 명령어 세팅(대문자 /  소문자)
-- 대소문자 구분 X
-- Edit > Format > UPCASE(대문자) > lowercase(소문자)

-- 4. sql 유용한 단축키
-- 파일 저장 : ctrl + s
-- 한 줄 복사 : ctrl + d
-- 한 줄 삭제 : ctrl + l
-- 실행 단축키
-- : 마우스 커서가 위치하는 쿼리문을 실행 ctrl + enter
-- : 마우스 드래그한 영역의 쿼리문을 실행 ctrl + shift + enter

-- 6. 자동 줄바꿈
-- 